In [1]:
import pandas as pd

In [2]:
daily_engagement = pd.read_csv('daily_engagement.csv')

In [6]:
daily_engagement.head()

,acct,utc_date,num_courses_visited,total_minutes_visited,lessons_completed,projects_completed
0,0,2015-01-09,1.0,11.679374,0.0,0.0
1,0,2015-01-10,2.0,37.284887,0.0,0.0
2,0,2015-01-11,2.0,53.633746,0.0,0.0
3,0,2015-01-12,1.0,33.489270,0.0,0.0
4,0,2015-01-13,1.0,64.779678,0.0,0.0

In [4]:
daily_engagement.describe()

,acct,num_courses_visited,total_minutes_visited,lessons_completed,projects_completed
count,136240.000000,136240.000000,136240.000000,136240.000000,136240.000000
mean,449.069488,0.341060,24.551680,0.128795,0.006731
std,321.104209,0.624565,62.102959,0.469311,0.085108
min,0.000000,0.000000,0.000000,0.000000,0.000000
25%,200.000000,0.000000,0.000000,0.000000,0.000000
50%,392.000000,0.000000,0.000000,0.000000,0.000000
75%,597.000000,1.000000,7.307366,0.000000,0.000000
max,1305.000000,10.000000,1030.883197,17.000000,3.000000

In [5]:
# account unique
len(daily_engagement['acct'].unique())

1237

In [ ]:
# pandas a estrutura de dados e chamada de serie
# numpy a estrutura de dados e chamada de array
# numpy numerical python 
# pandas criado na Ã¡rea financeira